package artsok.github.io.movie4k.data

import artsok.github.io.movie4k.R

open class DataStore {
    companion object {
        val movies = arrayListOf(
            Movie(
                1,
                R.drawable.image_1,
                "Джентльмены",
                "Один ушлый американец ещё со студенческих лет приторговывал наркотиками, а теперь придумал схему нелегального обогащения с использованием поместий обедневшей английской аристократии и очень неплохо на этом разбогател. Другой пронырливый журналист приходит к Рэю, правой руке американца, и предлагает тому купить киносценарий, в котором подробно описаны преступления его босса при участии других представителей лондонского криминального мира — партнёра-еврея, китайской диаспоры, чернокожих спортсменов и даже русского олигарха."
            ),
            Movie(
                2,
                R.drawable.image_2,
                "Заражение",
                "Международная организация врачей совместно с Центром по контролю и профилактике заболеваний США пытается помешать распространению смертельного вируса."
            ),
            Movie(
                3,
                R.drawable.image_3,
                "Платформа",
                "Горен соглашается на участие в некоем эксперименте и вскоре приходит в себя в почти пустой комнате уровня 48, где имеются большие прямоугольные отверстия в полу и потолке. На каждом уровне находятся двое человек, а сколько всего уровней — неизвестно. Этажи связывает общий колодец, по которому раз в день опускается платформа с едой, и чем ниже находятся люди, тем меньше у них шансов поесть. Каждый месяц происходит рокировка, и обитатели верхних уровней могут оказаться в самом низу, и наоборот. Поскольку разрешалось взять с собой один предмет, Горен выбрал томик «Дон Кихота», а его сосед прихватил большой самозатачивающийся нож."
            ),
            Movie(
                4,
                R.drawable.image_4,
                "Достать ножи",
                "На следующее утро после празднования 85-летия известного автора криминальных романов Харлана Тромби виновника торжества находят мёртвым. Налицо — явное самоубийство, но полиция по протоколу опрашивает всех присутствующих в особняке членов семьи, хотя, в этом деле больше заинтересован частный детектив Бенуа Блан. Тем же утром он получил конверт с наличными от неизвестного и заказ на расследование смерти Харлана. Не нужно быть опытным следователем, чтобы понять, что все приукрашивают свои отношения с почившим главой семейства, но Блану достаётся настоящий подарок — медсестра покойного, которая физически не выносит ложь."
            ),
            Movie(
                5,
                R.drawable.image_5,
                "Проект «Анна Николаевна»",
                "Отечественные учёные создали андроида-полицейского. Идеальная во всех отношениях капитан Анна Николаевна Королькевич отправляется служить в провинциальный город, чтобы увидеть реальную жизнь и стать похожей на человека. Коллеги думают, что Анна Николаевна — дочь замминистра, и ничто не предвещает беды, пока очеловечивание не заходит слишком далеко."
            ),
            Movie(
                6,
                R.drawable.image_6,
                "Последний министр",
                "Когда министром перспективного планирования назначают деятельного неудачника, никто представить не может, к чему это приведёт. Оказывается, новый министр действительно хочет изменить жизнь людей к лучшему и для этого вместе с командой активно продвигает собственные инициативы. Правда, инициативы эти не всегда разумны, а результат — крайне непредсказуем."
            ),
            Movie(
                7,
                R.drawable.image_2,
                "Заражение",
                "Международная организация врачей совместно с Центром по контролю и профилактике заболеваний США пытается помешать распространению смертельного вируса."
            ),
            Movie(
                8,
                R.drawable.image_4,
                "Достать ножи",
                "На следующее утро после празднования 85-летия известного автора криминальных романов Харлана Тромби виновника торжества находят мёртвым. Налицо — явное самоубийство, но полиция по протоколу опрашивает всех присутствующих в особняке членов семьи, хотя, в этом деле больше заинтересован частный детектив Бенуа Блан. Тем же утром он получил конверт с наличными от неизвестного и заказ на расследование смерти Харлана. Не нужно быть опытным следователем, чтобы понять, что все приукрашивают свои отношения с почившим главой семейства, но Блану достаётся настоящий подарок — медсестра покойного, которая физически не выносит ложь."
            ),
            Movie(
                9,
                R.drawable.image_5,
                "Проект «Анна Николаевна»",
                "Отечественные учёные создали андроида-полицейского. Идеальная во всех отношениях капитан Анна Николаевна Королькевич отправляется служить в провинциальный город, чтобы увидеть реальную жизнь и стать похожей на человека. Коллеги думают, что Анна Николаевна — дочь замминистра, и ничто не предвещает беды, пока очеловечивание не заходит слишком далеко."
            ),
            Movie(
                10,
                R.drawable.image_6,
                "Последний министр",
                "Когда министром перспективного планирования назначают деятельного неудачника, никто представить не может, к чему это приведёт. Оказывается, новый министр действительно хочет изменить жизнь людей к лучшему и для этого вместе с командой активно продвигает собственные инициативы. Правда, инициативы эти не всегда разумны, а результат — крайне непредсказуем."
            ),
            Movie(
                11,
                R.drawable.image_2,
                "Заражение",
                "Международная организация врачей совместно с Центром по контролю и профилактике заболеваний США пытается помешать распространению смертельного вируса."
            )
        )
    }
}